import React from 'react';
import CursesProfile from '../../../components/CursesProfile';

const page = () => {
	return (
		<div>
			<CursesProfile
				title='Python'
				subtitle='this AI course'
				houres='12'
				price='5000'
				color='bg-gray-500'
				borderColor='border-gray-500'
				textColor='text-gray-500'
				video='Y8Tko2YC5hA'
				image='/Box/amico.png'
				list={[
					'لمن لا يمتلك خبرة مسبقة في مجال البرمجة ويريد تعلم أساسيات بايثون',
					'لمن يمتلك خبرة بسيطة في البرمجة ويرغب في تطوير مهاراته في بايثون',
					'لمن يرغب في تعلم استخدام بايثون في مجالات مثل تحليل البيانات وتعلم الآلة',
					'لمن يريد بناء مشاريع عملية باستخدام بايثون لتعزيز مهاراته',
					'لمن يسعى للحصول على فرص عمل في مجال البرمجة باستخدام بايثون',
				]}
				about='أعد هذه الدورة نخبة من مبرمجي بايثون لنشرح لك لغة بايثون وتطبيقاتها العملية بأسلوب عملي شيق. بأخذلك للدورة ستصبح مطور بايثون محترف بمعرض أعمال رائع لتدخل سوق العمل بقوة، ستتعلم خلال 69 ساعة فيديو التطوير بلغة بايثون للتطبيقات ولمواقع الويب وأساسيات تحليل البيانات والذكاء الاصطناعي. بالاعتماد على النظريات السليمة والتطبيق العملي والدعم المباشر.

تعتمد الدورة على التطبيق العملي وعلى بناء مشاريع حقيقية، فإلى جانب تعلّم الأساسيات ستتعلم كيف تبني تطبيقات حقيقية اعتمادًا على لغة بايثون Python بحد ذاتها، وكيف تبني تطبيقات اعتمادًا على مختلف أطر العمل مثل جانغو وفلاسك وغيرها، وستتعلم كيفية دمج تطبيقات الذكاء الاصطناعي مع تطبيقاتك؛ الأمر الذي سيؤهلّك للعمل كمطوّر بايثون محترف ويضعك على الطريق الصحيح في مشوارك المهني كمبرمج.

ستبدأ الدورة بأساسيات البرمجة باستخدام لغة بايثون Python ومن أبسط المفاهيم البرمجية إلى المفاهيم المتقدمة وأفضل الأساليب المتبعة في البرمجة. الدورة هي عبارة عن مساق تدريبي كامل يبدأ من الصفر وينتهي عند إبداعك وبناء تطبيقك الأول. الدورة لا تعلّم الأساسيات فقط بل تضع المتدرب على بوابة الاحتراف ليكمل طريقه وينافس المحترفين.'
			/>
		</div>
	);
};

export default page;
