import React from 'react';
import CursesProfile from '../../../components/CursesProfile';

const page = () => {
	return (
		<div>
			<CursesProfile
				title='Python'
				subtitle='this AI course'
				houres='12'
				price='5000'
				color='bg-red-500'
				borderColor='border-red-500'
				textColor='text-red-500'
				video='Tef1e9FiSR0'
				image='/Box/amico.png'
				list={[
					'لمن لا يمتلك خبرة مسبقة في مجال تطوير الواجهات الأمامية ويريد تعلم الأساسيات',
					'لمن يمتلك خبرة بسيطة في تطوير الواجهات ويرغب في تطوير مهاراته ليصل إلى الاحترافية',
					'لمن يرغب في تعلم أحدث تقنيات وأدوات تطوير الواجهات الأمامية',
					'لمن يريد بناء محفظة أعمال قوية تعرض مهاراته في تطوير الواجهات',
					'لمن يسعى للحصول على فرص عمل في مجال تطوير الواجهات الأمامية',
					'لمن يرغب في تعلم كيفية بناء تطبيقات ويب تفاعلية باستخدام JavaScript وReact',
				]}
				about='أعد هذه الدورة أفضل مبرمجي جافاسكربت بتسلسل بسيط وواضح، بإنهائك لها ستصبح مطوّر برمجيات محترف باستخدام لغة جافا سكريبت JavaScript الشهيرة دون الحاجة لامتلاك معرفة مسبقة بالبرمجة، وستتعلم تطوير تطبيقات ويب احترافية خطوة بخطوة اعتمادًا على التجربة العملية والمادة العلمية التي يقدمها مدربون محترفون.

ستبدأ الدورة بأساسيات البرمجة باستخدام لغة جافا سكريبت JavaScript حيث ستعرض بأسلوب هندسي ممتع ومن أبسط المفاهيم البرمجية إلى المفاهيم المتقدمة بالإضافة إلى استعراض أفضل الأساليب المتبعة في البرمجة. الدورة هي عبارة عن مساق تدريبي كامل يبدأ من الصفر وينتهي عند إبداعك وبناء صفحاتك الأولى. الدورة لا تعلم الأساسيات فقط بل تضع المتدرب على بوابة الاحتراف ليكمل طريقه وينافس المحترفين.'
			/>
		</div>
	);
};

export default page;
